mise_a_niveau.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mise_a_niveau</title>
<!-- 2016-01-16 Sat 15:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="stephen batifol" />
</head>
<body>
<div id="content">
<h1 class="title">mise_a_niveau</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Mise a Niveau Ocaml</a>
<ul>
<li><a href="#sec-1-1">1.1. Programme Type</a></li>
<li><a href="#sec-1-2">1.2. Types de données</a></li>
<li><a href="#sec-1-3">1.3. Priorités</a></li>
<li><a href="#sec-1-4">1.4. Definitions de Fonctions</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Fonction partielle</a></li>
<li><a href="#sec-1-4-2">1.4.2. Variables locales</a></li>
<li><a href="#sec-1-4-3">1.4.3. Recursivité mutuelle</a></li>
<li><a href="#sec-1-4-4">1.4.4. Types structurées</a></li>
<li><a href="#sec-1-4-5">1.4.5. Traits impératifs</a></li>
<li><a href="#sec-1-4-6">1.4.6. Compilation</a></li>
<li><a href="#sec-1-4-7">1.4.7. Modules prédéfinis</a></li>
<li><a href="#sec-1-4-8">1.4.8. Exceptions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mise a Niveau Ocaml</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Programme Type</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Prog1.ml
</p>

<p>
let f n = n+1;;
</p>

<p>
let affiche n m = Printf.printf "Le successeur de %i est %i \n" n m;;
</p>

<p>
let f 4;;
</p>

<p>
Ocaml est statiquement typé (Comme Java, C etc) contrairement à Javascript/Python
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Types de données</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Concatener deux strings : On utilise ^
</p>

<p>
Il faut penser à rajouter "." après un signe opératoire sur des flottants
</p>

<p>
Les fonctions ont un seul type ! 
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Priorités</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Attention, l'appel de fonction est prioritaire en Ocaml
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Definitions de Fonctions</h3>
<div class="outline-text-3" id="text-1-4">
<p>
let fun<sub>name</sub> x1 &#x2026; xn = expression ;;
</p>

<p>
Si on veut que la fonction soit recursive, il faut penser à mettre rec après le let
Exemple : 
let rec fact n = 
   if n = 0 then 1 
   else n * fact(n-1)
   ;;
</p>

<p>
On peut passer une fonction en argument à une autre fonction
</p>

<p>
Ex : 
  let rec applique<sub>somme</sub> f n =
     if n = 0 then 0 
     else f n + applique<sub>somme</sub> f (n-1)
     ;;
 Exemple : 
 let carre n = n * n;;
 applique<sub>somme</sub> carre 10;;
 Resultat = 385
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Fonction partielle</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
On peut appeler une fonction partielle
let somme a b c = a +b+c;;
let ajout10 = somme 10;;
let ajout10<sub>5</sub> = somme 10 5;;
ajout 10 1 1 ;;
ajout10<sub>5</sub> 3;;
</p>


<p>
Les noms pour les fonctions commencent <b>toujours par une minuscule</b>
</p>
</div>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Variables locales</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
On peut utiliser des variables locales à l'aide du mot clé <b>in</b>
let varname1 = e1
   .
   .
   .
and varnameN = en
in e
</p>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Recursivité mutuelle</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Les varnamei ne sont disponible que dans e et non pas dans ei
On peut faire des fonctions mutuellement récursives 
</p>

<p>
let rec pair n =
  if n = 0 then true else 
  if n = 1 then false else impair(n-1)
and impair n =
  if n = 0 then flase else 
  if n = 1 then true else pair (n-1)
  ;;
</p>
</div>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> Types structurées</h4>
<div class="outline-text-4" id="text-1-4-4">
<ul class="org-ul">
<li>tuples
</li>
<li>listes
</li>
<li>tableaux
</li>
<li>Enregistrements
</li>
<li>Types perso
</li>
</ul>
</div>

<ol class="org-ol"><li><a id="sec-1-4-4-1" name="sec-1-4-4-1"></a>Definition de type persos<br  /><div class="outline-text-5" id="text-1-4-4-1">
<p>
type type<sub>name</sub> = type<sub>expr</sub>
type jour = int ;;
type date = jour *  mois * annee &#x2013;&gt; Renvoie un triplet
</p>
</div>
</li>

<li><a id="sec-1-4-4-2" name="sec-1-4-4-2"></a>Types sommes<br  /><div class="outline-text-5" id="text-1-4-4-2">
<p>
type type<sub>name</sub> = C1 [of type<sub>expr1]</sub>
                 (pipe) C2 [of type<sub>expr2]</sub>
</p>

<p>
.
.
.
(pipe) Cn [of type<sub>exprN]</sub> 
</p>

<p>
Les Ci sont des constructeurs de types. Leur nom commence par une <b>Majuscule</b>
</p>
</div>
</li>

<li><a id="sec-1-4-4-3" name="sec-1-4-4-3"></a><b>Match</b> LE SWITCH D'OCAML<br  /><ol class="org-ol"><li><a id="sec-1-4-4-3-1" name="sec-1-4-4-3-1"></a>Type algébrique<br  /><div class="outline-text-6" id="text-1-4-4-3-1">
<p>
let string<sub>of</sub><sub>couleur</sub> c = 
   match c with 
   (pipe) Coeur -&gt; "coeur"
   (pipe) Pique -&gt; "pique"
   (pipe) Trefle -&gt; "trefle"
   (pipe) Carreau -&gt; "carreau"
;;
</p>


<p>
let string<sub>of</sub><sub>valeur</sub> v = 
   match c with 
   valet -&gt; "Valet"
   (pipe) Dame -&gt; "dame"
   (pipe) Roi -&gt; "roi"
   (pipe) Valeur(x) -&gt;if x = 1 then "As" 
                      else string<sub>of</sub><sub>int</sub> x ;;
;;
</p>

<p>
let compare<sub>val</sub> v1 v2 = 
    match v1, v2 with 
    (pipe) Valeur(i), Valeur(j) -&gt; 
      if i &lt; j then -1 else if i = j then 0 else 1 
    (pipe) Roi, Roi (pipe) Dame,Dame (pipe)  Valet, Valet -&gt; 0
    (pipe) Roi, _ -&gt; 1
    (pipe) _,Roi -&gt; -1
    (pipe) Dame, _ -&gt; 1
    (pipe) _, Dame -&gt; -1
    (pipe) Valet, _ -&gt; 1
    (pipe) _, Valet -&gt; -1
;;
</p>
</div>
</li>

<li><a id="sec-1-4-4-3-2" name="sec-1-4-4-3-2"></a><span class="underline">tuples</span><br  /><div class="outline-text-6" id="text-1-4-4-3-2">
<p>
let paire<sub>int</sub> = (1,2);;
</p>

<p>
let xi = fst paire<sub>int</sub> ;; &#x2013;&gt; 1
</p>

<p>
let yi = snd paire<sub>int</sub> ;; &#x2013;&gt; 2
</p>
</div>
</li>
<li><a id="sec-1-4-4-3-3" name="sec-1-4-4-3-3"></a><span class="underline"><b>Polymorphisme</b></span><br  /><div class="outline-text-6" id="text-1-4-4-3-3">
<p>
fst;;
</p>
<ul class="org-ul">
<li>: 'a * 'b -&gt; 'a = &lt;fun&gt;
</li>
</ul>
<p>
La fonction fst est dit <b>polymorphe</b>. 'a et 'b sont des <b>variables de
type</b> ('a se lit alpha, 'b Beta &#x2026;).
</p>

<p>
fst peut s'appliquer à n'importe quelle paire, et renvoie une valeur
qui à le même type que la première composante de la paire.
</p>
</div>
</li>

<li><a id="sec-1-4-4-3-4" name="sec-1-4-4-3-4"></a><span class="underline">List</span><br  /><div class="outline-text-6" id="text-1-4-4-3-4">
<p>
<b>Le type de list est : 'a list</b>
let liste1 = [1;2;3];;
val list1 : int list = [1;2;3];;
</p>

<p>
L'opérateur <b>::</b> permet d'ajouter une nouvelle valeur en tête de liste
</p>

<p>
let rec longueur l = 
   match l with 
   (pipe) [] -&gt; 0
   (pipe) _ :: r -&gt; 1 + longueur r ;;
</p>

<p>
type de longueur : 'a list -&gt; int = &lt;fun&gt;`
</p>

<p>
let rec applique f l = 
    match l with 
    (pipe) [] -&gt; []
    (pipe) p :: r -&gt; (f p) :: (applique f r) ;;
</p>

<p>
type : applique : ('a -&gt; 'b) -&gt; 'a list -&gt; 'b list = &lt;fun&gt;
</p>

<p>
applique carre [1;10;5;4];;
</p>
<ul class="org-ul">
<li>: int list = [1;100;25;16]
</li>
</ul>
</div>
</li></ol>
</li></ol>
</div>


<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> Traits impératifs</h4>
<div class="outline-text-4" id="text-1-4-5">
</div><ol class="org-ol"><li><a id="sec-1-4-5-1" name="sec-1-4-5-1"></a>Références, enregistrements<br  /><div class="outline-text-5" id="text-1-4-5-1">
<p>
<span class="underline">Si on veut modifier une valeur pour une variable, il faut que cette
variable soit une référence</span>
Comme les struct en C 
let x = ref ();;
</p>

<p>
x := !x + 1;;
x := !x + 2;;
!x ;;
</p>

<ul class="org-ul">
<li>: int = 3
</li>
</ul>

<p>
<b>Mutable indique que l'on peut mettre à jour les valeurs</b>
</p>

<p>
type point<sub>mod</sub> = {mutable x : int, mutable y : int};;
</p>

<p>
let p = {x =1 ; y =2};;
</p>

<p>
p.y &lt;- 3 ; p;;
</p>


<p>
Une autre version de factoriel :
</p>

<p>
let fact<sub>for</sub> n = 
   let accu = ref 1 in 
      for i = 1 to n do 
        accu := i * !accu
      done;
      !accu
   ;;
</p>

<p>
<b>Pour enchainer les expressions renvoyant unit, il faut utiliser ";".</b>
</p>
</div>
</li></ol>
</div>


<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> Compilation</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
let affiche i = Printf.printf "J'affiche %i", 10;;
</p>


<p>
ocamlc -c a.ml
ls -&gt; a.ml a.cmo a.cmi main.ml
ocamlc -o prog a.cmo main.ml
./prog
</p>
</div>
</div>

<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7"><span class="section-number-4">1.4.7</span> Modules prédéfinis</h4>
<div class="outline-text-4" id="text-1-4-7">
</div><ol class="org-ol"><li><a id="sec-1-4-7-1" name="sec-1-4-7-1"></a>Module List<br  /><div class="outline-text-5" id="text-1-4-7-1">
<p>
Il contient les opérations sur les listes : List.hd, List.tl,
List.length ;&#x2026;
</p>
</div>
</li>
<li><a id="sec-1-4-7-2" name="sec-1-4-7-2"></a>Idem pour Array, String, HashTbl &#x2026;<br  /><div class="outline-text-5" id="text-1-4-7-2">
<p>
On peut ouvrir un module (comme pour les packages de Java). Ces
définitions peuvent alors être utilisable sans prefixe
</p>


<p>
Ex :
List.Length[1;2;3];;
open List;;
length [1;2;3];;
</p>
</div>
</li></ol>
</div>


<div id="outline-container-sec-1-4-8" class="outline-4">
<h4 id="sec-1-4-8"><span class="section-number-4">1.4.8</span> Exceptions</h4>
<div class="outline-text-4" id="text-1-4-8">
<p>
<b>Afin de lever une exception, on utilise raise Not<sub>found</sub></b> pour
 l'expression Not<sub>Found</sub>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: stephen batifol</p>
<p class="date">Created: 2016-01-16 Sat 15:53</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.51.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>