mise_a_niveau.tex
% Created 2016-01-17 Sun 16:49
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{stephen batifol}
\date{\today}
\title{mise\_a\_niveau}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.51.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Mise a Niveau Ocaml}
\label{sec-1}

\subsection{Programme Type}
\label{sec-1-1}

Prog1.ml

let f n = n+1;;

let affiche n m = Printf.printf "Le successeur de \%i est \%i \n" n m;;

let f 4;;

Ocaml est statiquement typé (Comme Java, C etc) contrairement à Javascript/Python

\subsection{Types de données}
\label{sec-1-2}
Concatener deux strings : On utilise \^{}

Il faut penser à rajouter "." après un signe opératoire sur des flottants

Les fonctions ont un seul type ! 
\subsection{Priorités}
\label{sec-1-3}
Attention, l'appel de fonction est prioritaire en Ocaml

\subsection{Definitions de Fonctions}
\label{sec-1-4}
let fun$_{\text{name}}$ x1 \ldots{} xn = expression ;;

Si on veut que la fonction soit recursive, il faut penser à mettre rec après le let
Exemple : 
let rec fact n = 
   if n = 0 then 1 
   else n * fact(n-1)
   ;;

On peut passer une fonction en argument à une autre fonction

Ex : 
  let rec applique$_{\text{somme}}$ f n =
     if n = 0 then 0 
     else f n + applique$_{\text{somme}}$ f (n-1)
     ;;
 Exemple : 
 let carre n = n * n;;
 applique$_{\text{somme}}$ carre 10;;
 Resultat = 385

\subsubsection{Fonction partielle}
\label{sec-1-4-1}
On peut appeler une fonction partielle
let somme a b c = a +b+c;;
let ajout10 = somme 10;;
let ajout10$_{\text{5}}$ = somme 10 5;;
ajout 10 1 1 ;;
ajout10$_{\text{5}}$ 3;;


Les noms pour les fonctions commencent \textbf{toujours par une minuscule}
\subsubsection{Variables locales}
\label{sec-1-4-2}
On peut utiliser des variables locales à l'aide du mot clé \textbf{in}
let varname1 = e1
   .
   .
   .
and varnameN = en
in e

\subsubsection{Recursivité mutuelle}
\label{sec-1-4-3}
Les varnamei ne sont disponible que dans e et non pas dans ei
On peut faire des fonctions mutuellement récursives 

let rec pair n =
  if n = 0 then true else 
  if n = 1 then false else impair(n-1)
and impair n =
  if n = 0 then flase else 
  if n = 1 then true else pair (n-1)
  ;;

\subsubsection{Types structurées}
\label{sec-1-4-4}
\begin{itemize}
\item tuples
\item listes
\item tableaux
\item Enregistrements
\item Types perso
\end{itemize}

\begin{enumerate}
\item Definition de type persos
\label{sec-1-4-4-1}
type type$_{\text{name}}$ = type$_{\text{expr}}$
type jour = int ;;
type date = jour *  mois * annee --> Renvoie un triplet

\item Types sommes
\label{sec-1-4-4-2}
type type$_{\text{name}}$ = C1 [of type$_{\text{expr1]}}$
                 (pipe) C2 [of type$_{\text{expr2]}}$

.
.
.
(pipe) Cn [of type$_{\text{exprN]}}$ 

Les Ci sont des constructeurs de types. Leur nom commence par une \textbf{Majuscule}

\item \textbf{Match} LE SWITCH D'OCAML
\label{sec-1-4-4-3}

\begin{enumerate}
\item Type algébrique
\label{sec-1-4-4-3-1}
let string$_{\text{of}}$$_{\text{couleur}}$ c = 
   match c with 
   (pipe) Coeur -> "coeur"
   (pipe) Pique -> "pique"
   (pipe) Trefle -> "trefle"
   (pipe) Carreau -> "carreau"
;;


let string$_{\text{of}}$$_{\text{valeur}}$ v = 
   match c with 
   valet -> "Valet"
   (pipe) Dame -> "dame"
   (pipe) Roi -> "roi"
   (pipe) Valeur(x) ->if x = 1 then "As" 
                      else string$_{\text{of}}$$_{\text{int}}$ x ;;
;;

let compare$_{\text{val}}$ v1 v2 = 
    match v1, v2 with 
    (pipe) Valeur(i), Valeur(j) -> 
      if i < j then -1 else if i = j then 0 else 1 
    (pipe) Roi, Roi (pipe) Dame,Dame (pipe)  Valet, Valet -> 0
    (pipe) Roi, \_ -> 1
    (pipe) \_,Roi -> -1
    (pipe) Dame, \_ -> 1
    (pipe) \_, Dame -> -1
    (pipe) Valet, \_ -> 1
    (pipe) \_, Valet -> -1
;;

\item \underline{tuples}
\label{sec-1-4-4-3-2}
let paire$_{\text{int}}$ = (1,2);;

let xi = fst paire$_{\text{int}}$ ;; --> 1

let yi = snd paire$_{\text{int}}$ ;; --> 2
\item \underline{\textbf{Polymorphisme}}
\label{sec-1-4-4-3-3}

fst;;
\begin{itemize}
\item : 'a * 'b -> 'a = <fun>
\end{itemize}
La fonction fst est dit \textbf{polymorphe}. 'a et 'b sont des \textbf{variables de
type} ('a se lit alpha, 'b Beta \ldots{}).

fst peut s'appliquer à n'importe quelle paire, et renvoie une valeur
qui à le même type que la première composante de la paire.

\item \underline{List}
\label{sec-1-4-4-3-4}
\textbf{Le type de list est : 'a list}
let liste1 = [1;2;3];;
val list1 : int list = [1;2;3];;

L'opérateur \textbf{::} permet d'ajouter une nouvelle valeur en tête de liste

let rec longueur l = 
   match l with 
   (pipe) [] -> 0
   (pipe) \_ :: r -> 1 + longueur r ;;

type de longueur : 'a list -> int = <fun>`

let rec applique f l = 
    match l with 
    (pipe) [] -> []
    (pipe) p :: r -> (f p) :: (applique f r) ;;

type : applique : ('a -> 'b) -> 'a list -> 'b list = <fun>

applique carre [1;10;5;4];;
\begin{itemize}
\item : int list = [1;100;25;16]
\end{itemize}
\end{enumerate}
\end{enumerate}


\subsubsection{Traits impératifs}
\label{sec-1-4-5}
\begin{enumerate}
\item Références, enregistrements
\label{sec-1-4-5-1}
\uline{Si on veut modifier une valeur pour une variable, il faut que cette
variable soit une référence}
Comme les struct en C 
let x = ref ();;

x := !x + 1;;
x := !x + 2;;
!x ;;

\begin{itemize}
\item : int = 3
\end{itemize}

\textbf{Mutable indique que l'on peut mettre à jour les valeurs}

type point$_{\text{mod}}$ = \{mutable x : int, mutable y : int\};;

let p = \{x =1 ; y =2\};;

p.y <- 3 ; p;;


Une autre version de factoriel :

let fact$_{\text{for}}$ n = 
   let accu = ref 1 in 
      for i = 1 to n do 
        accu := i * !accu
      done;
      !accu
   ;;

\textbf{Pour enchainer les expressions renvoyant unit, il faut utiliser ";".}
\end{enumerate}


\subsubsection{Compilation}
\label{sec-1-4-6}

let affiche i = Printf.printf "J'affiche \%i", 10;;


ocamlc -c a.ml
ls -> a.ml a.cmo a.cmi main.ml
ocamlc -o prog a.cmo main.ml
./prog

\subsubsection{Modules prédéfinis}
\label{sec-1-4-7}
\begin{enumerate}
\item Module List
\label{sec-1-4-7-1}
Il contient les opérations sur les listes : List.hd, List.tl,
List.length ;\ldots{}
\item Idem pour Array, String, HashTbl \ldots{}
\label{sec-1-4-7-2}

On peut ouvrir un module (comme pour les packages de Java). Ces
définitions peuvent alors être utilisable sans prefixe


Ex :
List.Length[1;2;3];;
open List;;
length [1;2;3];;
\end{enumerate}


\subsubsection{Exceptions}
\label{sec-1-4-8}
\textbf{Afin de lever une exception, on utilise raise Not$_{\text{found}}$} pour
 l'expression Not$_{\text{Found}}$
% Emacs 24.4.51.2 (Org mode 8.2.10)
\end{document}